""" 
Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. 
Поскольку разобраться в его кричалках не настолько просто, 
насколько легко он их придумывает, Вам стоит написать программу. 
Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) 
в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, 
если во фразе несколько слов, то они разделяются дефисами. 
Фразы отделяются друг от друга пробелами.
Стихотворение Винни-Пух вбивает в программу с клавиатуры. 
В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и 
“Пам парам”, если с ритмом все не в порядке 
Ввод: пара-ра-рам рам-пам-папам па-ра-па-дам Вывод: Парам пам-пам 
"""

vowels = ['а', 'о', 'у', 'ы', 'э', 'е', 'и', 'ю', 'я']
print("\n   Наберите стихотворение с клавиатуры.")
print("Фраза может состоять из одного слова, если во фразе")
print("несколько слов, то они разделяются дефисами.\n")

st = input('Наберите стихотворение: ').split()
temp = []
coun = 0

for elem in st:
    for i in range(len(elem)):
        for vow in vowels:
            if elem[i] == vow:
                coun += 1
    temp.append(coun)
    coun = 0

st1 = list(filter(lambda x: x == temp[0], temp))
print("Как дела с ритмом --> ", end='')

if len(temp) == len(st1):
    print("Парам пам-пам\n")
else:
    print("Пам парам\n")
